---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsEndNotchOption
source: html/d0586a61-e38c-2a6b-f544-4ffdb7e91d8f.htm
---
# Autodesk.Revit.DB.Architecture.StairsEndNotchOption

The style of notch width for the stairs.

## Syntax (C#)
```csharp
public enum StairsEndNotchOption
```